import React from "react";

let initialState = {
    battleroyal: [
        {

            id: 2,
            name: <h1>"Call of Duty"</h1>,
            avatar: <img
                src="https://upload.wikimedia.org/wikipedia/ru/5/5f/COD_Warzone.jpg"/>,
            text: <p>Call of Duty: Warzone — компьютерная игра в жанре королевской битвы, разработанная компаниями
                Infinity Ward и Raven Software и изданная Activision 10 марта 2020 года для ПК, PlayStation 4 и Xbox
                One. Warzone позволяет вести многопользовательскую онлайн-борьбу между 150 игроками, находящимися
                в вымышленном городе Верданск.

                В игре есть два основных режима — «добыча» и «королевская битва». Warzone использует новую
                внутриигровую валюту, которую можно использовать на станциях покупки внутри Верданска и в его
                окрестностях. Игроки также могут использовать валюту игры для покупки предметов, например, серий
                убийств или противогазов. На момент запуска игры, Warzone позволял играть только в отряде из 3
                человек. Неделю спустя, 17 марта 2020 года, в игру был добавлен соло-режим. Позднее, 8 апреля 2020
                года, одновременно с патчем третьего сезона Modern Warfare, в игру был добавлен отряд из 4
                человек.

                10 апреля 2020 года компания Activision отчиталась о 50 миллионах скачиваний игры за первый
                месяц.</p>
        }
    ]

};

const battleroyalsReducer = (state = initialState)=> {
    return{
state
    }
}

export default battleroyalsReducer;