import React from "react";


let state = {
    gamesList: {
        rpg: [
            {
                id: 1,
                name: <h1>"World Of Warcraft"</h1>,
                avatar: <img
                    src="https://lh3.googleusercontent.com/proxy/jeBc-gs7uphHymJty6Vjobpv0sq3LdO48AX0CVAsg4HlVClYLgWc9JbM-wFQghHWmlhyrt0Zbp8lyS8pTtZoNTI9ux4_VuoxLJRX64BMv6PZjfWxH7FYRp5T3UzHa4aW59-yoO6BVI5Ku_yCt9o1L_9g3tU_tbI"/>,
                text: <p> WoW Classic предлагает увидеть мир игры в том виде, в котором он был на момент контентного
                    обновления 1.12.1 (сентябрь 2006 года) перед выходом первого дополнения — The Burning Crusade.
                    Максимальный уровень персонажа — 60, а в игре отсутствует любое контентное обновление. В игре
                    полностью воспроизведён тот самый игровой процесс и механики, которые были 13 лет назад. Так как
                    многочисленные обновления со временем кардинально изменили игровой процесс, WoW Classic позволяет
                    игрокам вновь испытать те самые чувства и эмоции, хотя некоторые современные интерфейсы и
                    функциональные улучшения, представленные в более поздних обновлениях и дополнениях, были
                    интегрированы, а также устранены различного рода ошибки, которые присутствовали в оригинальной
                    версии обновления 1.12.
                    <br/>
                    <br/>

                    Игрокам для создания персонажа доступны 8 рас, которые были представлены в оригинальном World of
                    Warcraft: люди, дворфы, ночные эльфы и гномы для Альянса; орки, Отрёкшиеся, таурены и тролли для
                    Орды; а также 9 классов: воин, паладин, охотник, шаман, друид, разбойник, жрец, маг, чернокнижник.
                    Как и в оригинальной версии игры, класс паладинов доступен только персонажам Альянса, а класс
                    шаманов — персонажам ОрдыПерейти к разделу «#Сочетание рас и классов». Мир представляет из себя лишь
                    2 континента: Калимдор и Восточные королевства.

                    Как и в любом другом дополнении, контент в WoW Classic будет добавляться на протяжении шести
                    обновлений, чтобы игроки могли постепенно развивать своих героев. Игровой контент, первоначально
                    выпущенный в таких обновлениях, как «Логово Крыла Тьмы», «Ан'Кираж» и «Наксрамас», поля битвы, такие
                    как «Ущелье Песни Войны» и «Альтеракская долина», а также некоторые предметы и задания, станут
                    доступны после соответствующего обновления. В отличие от обновлений для оригинальной игры, эти
                    обновления не будут изменять механику основной игры, например, способности персонажа; баланс игры
                    будет сохраняться на том уровне, на котором он был в обновлении 1.12.1.</p>
            },

        ],
        battleroyal: [
            {

                id: 2,
                name: <h1>"Call of Duty"</h1>,
                avatar: <img
                    src="https://upload.wikimedia.org/wikipedia/ru/5/5f/COD_Warzone.jpg"/>,
                text: <p>Call of Duty: Warzone — компьютерная игра в жанре королевской битвы, разработанная компаниями
                    Infinity Ward и Raven Software и изданная Activision 10 марта 2020 года для ПК, PlayStation 4 и Xbox
                    One. Warzone позволяет вести многопользовательскую онлайн-борьбу между 150 игроками, находящимися
                    в вымышленном городе Верданск.

                    В игре есть два основных режима — «добыча» и «королевская битва». Warzone использует новую
                    внутриигровую валюту, которую можно использовать на станциях покупки внутри Верданска и в его
                    окрестностях. Игроки также могут использовать валюту игры для покупки предметов, например, серий
                    убийств или противогазов. На момент запуска игры, Warzone позволял играть только в отряде из 3
                    человек. Неделю спустя, 17 марта 2020 года, в игру был добавлен соло-режим. Позднее, 8 апреля 2020
                    года, одновременно с патчем третьего сезона Modern Warfare, в игру был добавлен отряд из 4
                    человек.

                    10 апреля 2020 года компания Activision отчиталась о 50 миллионах скачиваний игры за первый
                    месяц.</p>
            }
        ]

    }
};

export default state;